using System;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using Random = UnityEngine.Random;

public class QuestionsDatabase : MonoBehaviour
{
    public static List<string[]> questionsLevel1 = new List<string[]>();
    public static List<string[]> questionsLevel2 = new List<string[]>();
    public static List<string[]> questionsLevel3 = new List<string[]>();
    public static List<string[]> questionsLevel4Panel = new List<string[]>();
    

    // public string[] displayQustion(int preSignedLevel)
    // {
    //     switch (preSignedLevel)
    //     {
    //         case 1:
    //             return questionsLevel1[Random.Range(0, 30)][1];
    //     }
    // }
    
    public void writeNewQuestion()
    {
        
    }
    
    void Start()
    {   // ΙΣΩΣ ΝΑ ΜΠΟΡΟΥΣΑ ΝΑ ΕΦΑΡΜΟΣΩ ΚΑΤΙ ΣΑΝ ΤΟ SAVE ΔΗΛΑΔΗ ΝΑ ΔΟΥΛΕΨΩ ΕΝΑ JSON ΑΡΧΕΙΟ
        // ΑΛΛΑ ΑΥΤΟ ΜΠΟΡΕΙ ΝΑ ΔΗΜΙΟΥΡΓΗΣΕΙ ΑΡΚΕΤΑ ΠΡΟΒΛΗΜΑ ΣΤΗΝ ΔΙΑΔΙΚΑΣΙΑ ΑΝΑΓΝΩΣΗΣ ΚΑΙ
        // ΕΓΓΡΑΦΗΣ ΤΩΝ ΕΡΩΤΗΣΕΩΝ ΟΠΟΤΕ ΣΚΕΦΤΗΚΑ ΛΟΓΩ ΚΑΙ ΤΟΥ ΟΤΙ ΕΙΝΑΙ ΣΕ ΑΡΚΕΤΑ 
        // ΠΡΩΙΜΟ ΣΤΑΔΙΟ ΤΟ PROJECT ΝΑ ΤΟ ΑΦΗΣΩ ΜΕ ΤΟΝ ΑΠΛΟ ΤΡΟΠΟ
        questionsLevel1.Clear(); 
        questionsLevel1.Add(new string[]{"Ποιος είναι ο νόμος της ζήτησης?",
            "Όσο η τιμή αυξάνεται τόσο η ζητούμενη ποσότητα μειώνεται",
            "Όσο το εισόδημα αυξάνεται τόσο η ζητούμενη ποσότητα αυξάνεται",
            "Όσο η τιμή αυξάνεται τόσο η ζητούμενη ποσότητα αυξάνεται",
            "Όσο η τιμή αυξάνεται τόσο η ζήτησ μειώνεται",
            "1",
            "E"
        }); 
        questionsLevel1.Add(new string[]{"Επίλεξε τη σωστή απάντηση:",
            "Όλα τα αγαθά είναι εμπορεύματα.",
            "Όλα τα εμπορεύματα είναι αγαθά.",
            "Όλα τα αγαθά είναι οικονομικά αγαθά.",
            "Όλα είναι λάθος.",
            "2",
            "E"
        });
        questionsLevel1.Add(new string[]{"Το laptop που χρησιμοποιεί  στην εργασία του ένας προγραμματιστής είναι:",
            "υλικό, καταναλωτό και κεφαλαιουχικό",
            "υλικό, καταναλωτό και καταναλωτικό",
            "υλικό, διαρκές και καταναλωτικό",
            "υλικό, διαρκές και κεφαλαιουχικό",
            "4",
            "E"
        });
        questionsLevel1.Add(new string[]{"Το κύριο οικονομικό πρόβλημα:",
            "Eίναι προσωρινό, οπότε δεν χρειάζεται λύση.",
            "Aφορά μόνο τις πολύ ανεπτυγμένες χώρες .",
            "Aποσχολεί μόνο τους εργάτες.",
            "Eίναι μόνιμο και απασχολεί κάθε κοινωνία.",
            "4",
            "E"
        });
        questionsLevel1.Add(new string[]{"Το βασικό οικονομικό πρόβλημα της κάθε χώρας είναι:",
            "H έλλειψη γνώσης των εργαζομένων.",
            "H σχετική έλλειψη των παραγωγικών συντελεστών.",
            "H σχετική έλλειψη οργάνωσης των παραγωγών.",
            "H ανεπαρκής ενημέρωση των επιχειρήσεων για τις ανάγκες των καταναλωτών ",
            "2",
            "E"
        });
        questionsLevel1.Add(new string[]{"Χρήμα είναι οτιδήποτε οι άνθρωποι θεωρούν ότι έχει αξία ?",
            "Σωστό",
            "Λάθος",
            "",
            "",
            "2",
            "E"
        });
        questionsLevel1.Add(new string[]{"Οι ροές που γίνονται μεταξύ των βασικών μονάδως του οικονομικού συστήματος είναι...",
            "ροές αγαθών, παραγωγικών συντελεστών και χρήματος.",
            "ροές  χρήματος και παραγωγικών συντελεστών.",
            "ροές αγαθών και χρήματος.",
            "μόνο χρήματος.",
            "1",
            "E"
        });
        questionsLevel1.Add(new string[]{"Οι ροές προϊόντων, παραγωγικών συντελεστών και χρήματος στο οικονομικό κύκλωμα, είναι συνεχείς και δεν έχουν πάντα το ίδιο μέγεθος.",
            "Σωστό",
            "Λάθος",
            "",
            "",
            "1",
            "E"
        });
        questionsLevel1.Add(new string[]{"Ο όρος οικονομικό κύκλωμα χαρακτηρίζει το σύνολο των σχέσεων που δημιουργούνται μεταξύ των βασικών μονάδων του οικονομικού κυκλώματος.",
            "Σωστό",
            "Λάθος",
            "3",
            "4",
            "1",
            "E"
        });
        questionsLevel1.Add(new string[]{"Ορθολογικός είναι ένας καταναλωτής που:",
            "έχει υψηλό εισόδημα.",
            "η ισορροπία του δεν επηρεάζεται από τις τιμές των αγαθών.",
            "επιλέγει αυτά τα αγαθά και σε εκείνες τις ποσότητες που με βάση το εισόδημά του μεγιστοποιεί τη χρησιμότητά του από τη κατανάλωσή τους.",
            "ζητάει την επανάληψη μιας απόλαυσης που αποκτά από τη κατανάλωση ενός αγαθού.",
            "3",
            "E"
        });
        questionsLevel1.Add(new string[]{"Η καμπύλη αγοραίας ζήτησης για ένα αγαθό, προκύπτει όταν:",
            "αφαιρέσουμε τις τιμές από τις ποσότητες του ζητούμενου αγαθού.",
            "αθροίσουμε οριζόντια τις καμπύλες ατομικής ζήτησης.",
            "αθροίσουμε κατακόρυφα τις καμπύλες ατομικής ζήτησης",
            "όλα τα παραπάνω.",
            "2",
            "E"
        }); 
        questionsLevel1.Add(new string[]{"Ο όρος ceteris paribus σημαίνει:",
            "όλα ίσα μεταξύ τους.",
            "όλα άνισα μεταξύ τους",
            "τα άλλα μεταβλητά.",
            "τα άλλα σταθερά",
            "4",
            "E"
        });
        questionsLevel1.Add(new string[]{"Η ζήτηση ενός κανονικού αγαθού αυξάνεται, όταν:",
            "αυξάνεται η τιμή ενός συμπληρωματικού αγαθού.",
            "μειώνεται η τιμή ενός συμπληρωματικού αγαθού.",
            "αυξάνεται ο αριθμός των καταναλωτών.",
            "σε κάθε περίπτωση.",
            "2",
            "E"
        });
        questionsLevel1.Add(new string[]{"Όταν αυξάνεται η ζήτηση, τότε:",
            "η καμπύλη ζήτησης μετατοπίζεται δεξιά.",
            "η καμπύλη ζήτησης μετατοπίζεται αριστερά.",
            "επηρεάζεται μόνο η καμπύλη προσφοράς.",
            "δεν επηρεάζεται η καμπύλη ζήτησης.",
            "1",
            "Ε"
        });
        questionsLevel1.Add(new string[]{"Ποιο από τα παρακάτω είναι ΛΑΘΟΣ?",
            "Β <- 2 * 7 ",
            "Β <-  2 * “Β” - 4",
            "Β <- 2 * Β",
            "Β <- 2 * Β - 4",
            "2",
            "T"
        });
        questionsLevel1.Add(new string[]{"Ποιο από τα παρακάτω είναι σωστό?",
            "Η έννοια του αλγορίθμου συνδέεται αποκλειστικά με την πληροφορική.",
            "Ο πιο δομημένος τρόπος παρουσίασης αλγορίθμων είναι με ελεύθερο κείμενο.",
            "Ένας αλγόριθμος στοχεύει στην επίλυση ενός προβλήματος.",
            "Το πηγαίο πρόγραμμα εκτελείται από τον υπολογιστή χωρίς μεταγλώττιση.",
            "3",
            "T"
        });
        questionsLevel1.Add(new string[]{"Ποιο από τα παρακάτω είναι σωστό?",
            "Σε μια δομή επανάληψης μπορεί να εμφανιστούν λογικά λάθη που σχετίζονται με τη συνθήκη επανάληψης ή τερματισμού.",
            "Υπερχείλιση έχουμε όταν ωθήσουμε ένα στοιχείο σε μια ήδη γεμάτη στοίβα.",
            "Γενικά, σε περιπτώσεις που η επανάληψη θα συμβεί τουλάχιστον μία φορά, είναι προτιμότερη η χρήση της ΜΕΧΡΙΣ_ΟΤΟΥ.",
            "Ο βρόχος ΓΙΑ i AΠΟ 0 ΜΕΧΡΙ 0 δεν εκτελείται καμία φορά.",
            "4",
            "T"
        });
        questionsLevel1.Add(new string[]{"Ποιο από τα παρακάτω είναι ΛΑΘΟΣ?",
            "Η συνθήκη στην εντολή «Όσο...επανάλαβε» ελέγχεται τουλάχιστον μια φορά.",
            "Η πιο απλή μορφή αναζήτησης στοιχείου σε πίνακα είναι η σειριακή μέθοδος.",
            "Μετά από την εκτέλεση της εντολής Σ <- Σ + Α, η τιμή της μεταβλητής Σ είναι πάντοτε μεγαλύτερη από την τιμή που είχε πριν από την εκτέλεση της εντολής.",
            "Οι πίνακες περιορίζουν τις δυνατότητες του προγράμματος.",
            "3",
            "T"
        });
        questionsLevel1.Add(new string[]{"Σύμφωνα με τα παρακάτω ποιο είναι το σωστό?",
            "Στην περίπτωση που το A=2 τότε το ΑΝ Α > 2 εκτελείται.",
            "Στην περίπτωση εκτέλεσης του ΓΙΑ i ΑΠΟ 1 ΕΩΣ 10 το κομμάτι κώδικα μεσα στην δομή επανάληψης εκτελείται 9 ακριβώς φορές.",
            "Στην περίπτωση του Α <> 2 τότε το ΑΝ Α > 2 εκτελείται.",
            "Στην περίπτωση που το Α = 2 και Β = “2” τότε Α και Β είναι ΧΑΡΑΚΤΗΡΕΣ.",
            "3",
            "T"
        });
        questionsLevel1.Add(new string[]{"Α <- 15\nΓΡΑΨΕ Α, Ά'\nΠοια είναι το σωστό αποτέλεσμα?",
            "Α15",
            "1515",
            "ΑΑ",
            "15Α",
            "4",
            "T"
        }); 
        questionsLevel1.Add(new string[]{"Ποια είναι η εντολή εκχώρησης για την εκχώρηση της τιμής 5?",
            "Α = 5",
            "Α <= 5",
            "Α -> 5",
            "Α <- 5 ",
            "4",
            "T"
        });
        questionsLevel1.Add(new string[]{"Από το Χ <- ΑΛΗΘΗΣ καταλαβαίνεις ότι το Χ είναι μια μεταβλητή:",
            "Ακέραια",
            "Πραγματική",
            "Λογική",
            "Χαρακτήρας",
            "3",
            "T"
        });
        questionsLevel1.Add(new string[]{"Από το Χ <- “Αληθής” καταβαίνεις ότι το Χ είναι μια μεταβλητή:",
            "Ακέραια",
            "Πραγματική",
            "Λογική",
            "Χαρακτήρας",
            "4",
            "T"
        });
        questionsLevel1.Add(new string[]{"Ποια από τις παρακάτω εντολές ζητάει από το χρήστη να εισάγει τιμές στις μεταβλητές α,β,γ ?",
            "ΔΙΑΒΑΣΕ α + β + γ",
            "ΔΙΑΒΑΣΕ α, β, γ",
            "ΔΙΑΒΑΣΕ ‘α ‘+ ‘β ‘+ ‘γ’",
            "ΔΙΑΒΑΣΕ 'α’, ‘β’, ‘γ’",
            "2",
            "T"
        });
        questionsLevel1.Add(new string[]{"Ποιο από τα παρακάτω κομμάτια κώδικα εκτελούν σωστά το άθροιμα του Κ και του Λ ?",
            "αθρ <- ‘κ’ + λ ",
            "αθρ <- ‘κ’ + ‘λ’ ",
            "αθρ <- κ + λ",
            "Κανένα",
            "3",
            "T"
        });
        questionsLevel1.Add(new string[]{"Δίνοντας αυτόν τον κώδικα Χ <- 4 * 2 / 2 - 4 ποιο θα είναι το αποτέλεσμά του",
            "0",
            "-2",
            "Δεν είναι δυνατή η εκτέλεση του (έχει 0 ως παρανομαστή)",
            "4",
            "1",
            "T"
        });
        questionsLevel1.Add(new string[]{"Εκτελείται ο κώδικας  ΓΡΑΨΕ ‘Η τιμή είναι’ Χ?",
            "Ναι",
            "Όχι, γιατί θα έπρεπε να είναι ΓΡΑΨΕ ‘Η τιμή είναι’, Χ",
            "Όχι, γιατί δεν μπορεί να εμφανίσει και χαρακτήρες και την τιμή Χ",
            "Κανένα δεν είναι σωστό",
            "2",
            "T"
        });
        // ----- Δευτερη κατηγορια -------
    }
}
